Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 virtual users"
    - duration: 60
      arrivalRate: 100
      name: "Sustained baseline load"
scenarios:
  - name: "API Health & Public Endpoints"
    flow:
      - get:
          url: "/api/health"
